vanvught/GD32F103RC-DMX512-RDM/lib-flashcode/src/gd32/h7xx/flashcode.cpp
/**
 * @file flashcode.cpp
 *
 */
/* Copyright (C) 2024 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <cstdint>
#include <cstring>
#include <cassert>

#include "flashcode.h"
#include "gd32.h" // IWYU pragma: keep
#include "firmware/debug/debug_debug.h"

namespace {
// Backwards compatibility with SPI FLASH
constexpr auto kFlashSectorSize = 4096U;
// The flash page size is 4KB for bank1
constexpr auto kBanK1FlashPage = (4U * 1024U);

enum class State { kIdle, kEraseBusy, kEraseProgam, kWriteBusy, kWriteProgram, kError };

State s_state = State::kIdle;
uint32_t s_page;
uint32_t s_length;
uint32_t s_address;
uint32_t* s_data;
} // namespace

using flashcode::Result;

uint32_t FlashCode::GetSize() const {
    const auto kFlashDensity = ((REG32(0x1FF0F7E0) >> 16) & 0xFFFF) * 1024U;
    return kFlashDensity;
}

uint32_t FlashCode::GetSectorSize() const {
    return kFlashSectorSize;
}

bool FlashCode::Read(uint32_t offset, std::span<uint8_t> buffer, Result& result) {
    DEBUG_ENTRY();
    DEBUG_PRINTF("offset=%x, len=%u, data=%p", static_cast<unsigned>(offset), static_cast<unsigned>(buffer.size()), buffer.data());

    assert((buffer.size() & 0x3U) == 0);
    assert((reinterpret_cast<uintptr_t>(buffer.data()) & 0x3U) == 0);

    const auto* src = reinterpret_cast<const uint32_t*>(offset + FLASH_BASE);
    auto* dst = reinterpret_cast<uint32_t*>(buffer.data());

    auto length = buffer.size();

    while (length >= sizeof(uint32_t)) {
        *dst++ = *src++;
        length -= sizeof(uint32_t);
    }

    result = Result::kOk;

    DEBUG_EXIT();
    return true;
}

bool FlashCode::Erase(uint32_t offset, uint32_t length, flashcode::Result& result) {
    DEBUG_ENTRY();
    DEBUG_PRINTF("State=%d", static_cast<int>(s_state));

    result = Result::kOk;

    switch (s_state) {
        case State::kIdle:
            s_page = offset + FLASH_BASE;
            s_length = length;
            fmc_unlock();
            s_state = State::kEraseBusy;
            DEBUG_EXIT();
            return false;
            break;
        case State::kEraseBusy:
            if (SET == fmc_flag_get(FMC_FLAG_BUSY)) {
                DEBUG_EXIT();
                return false;
            }

            if (s_length == 0) {
                s_state = State::kIdle;
                fmc_lock();
                DEBUG_EXIT();
                return true;
            }

            s_state = State::kEraseProgam;
            DEBUG_EXIT();
            return false;
            break;
        case State::kEraseProgam:
            if (s_length > 0) {
                DEBUG_PRINTF("s_page=%p", reinterpret_cast<void*>(s_page));

                fmc_sector_erase(s_page);

                s_length -= kBanK1FlashPage;
                s_page += kBanK1FlashPage;
            }

            s_state = State::kEraseBusy;
            DEBUG_EXIT();
            return false;
            break;
        default:
            assert(0);
            __builtin_unreachable();
            break;
    }

    assert(0);
    __builtin_unreachable();
    return true;
}

bool FlashCode::Write(uint32_t offset, std::span<const uint8_t> buffer, flashcode::Result& result) {
    if ((s_state == State::kWriteProgram) || (s_state == State::kWriteBusy)) {
    } else {
        DEBUG_ENTRY();
    }

    result = Result::kOk;

    switch (s_state) {
        case State::kIdle:
            DEBUG_PUTS("State::IDLE");

            assert((buffer.size() & 0x3U) == 0);
            assert((reinterpret_cast<uintptr_t>(buffer.data()) & 0x3U) == 0);

            s_address = offset + FLASH_BASE;
            s_data = reinterpret_cast<const uint32_t*>(buffer.data());
            s_length = static_cast<uint32_t>(buffer.size());

            fmc_unlock();

            s_state = State::kWriteBusy;

            DEBUG_EXIT();
            return false;

        case State::kWriteBusy:
            if (SET == fmc_flag_get(FMC_FLAG_BUSY)) {
                DEBUG_EXIT();
                return false;
            }

            if (s_length == 0) {
                fmc_lock();
                s_state = State::kIdle;

                if (memcmp(reinterpret_cast<void*>(offset + FLASH_BASE), buffer.data(), buffer.size()) == 0) {
                    DEBUG_PUTS("memcmp OK");
                } else {
                    DEBUG_PUTS("memcmp failed");
                }

                DEBUG_EXIT();
                return true;
            }

            s_state = State::kWriteProgram;
            return false;

        case State::kWriteProgram:
            if (s_length >= sizeof(uint32_t)) {
                if (FMC_READY == fmc_ready_wait(0xFF)) {
                    FMC_CTL |= FMC_CTL_PG;

                    __ISB();
                    __DSB();

                    REG32(s_address) = *s_data;

                    __ISB();
                    __DSB();

                    FMC_CTL &= ~FMC_CTL_PG;

                    ++s_data;
                    s_address += sizeof(uint32_t);
                    s_length -= sizeof(uint32_t);
                }
            } else if (s_length > 0) {
                DEBUG_PUTS("Error!");
            }

            s_state = State::kWriteBusy;
            return false;

        default:
            assert(false);
            __builtin_unreachable();
    }
}
